Revit 2027 API
BuiltInFailures.ExternalResourceReferenceFailures.ReferenceToLocalFile Property
 The External Resource refers to a local file that may not be available to workshared users.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReferenceToLocalFile { get; }
Public Shared ReadOnly Property ReferenceToLocalFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReferenceToLocalFile {
	FailureDefinitionId^ get ();
}
static member ReferenceToLocalFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExternalResourceReferenceFailures Class
Autodesk.Revit.DB Namespace